Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-43-53.tmx
Source language: bo
Languages: en

source: མུ་ཏིག་གི་ཕྲེང་བ་སྣ་ཚོགས་ཀྱི་དྲ་བ་གྲངས་མེད་པ་ཀུན་ནས་བྲེས་པ།
en: Countless nets of various strings of pearls were spread upon it.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣ་ཚོགས་རབ་ཏུ་སྤ་བར་སྤེལ་བས་བརྒྱན་པ།
en: It was adorned by a beautifying blend of various kings of jewels.

source: འཛམ་བུ་ཆུ་ཀླུང་གི་ནོར་བུ་རིན་པོ་ཆེས་ཀུན་ནས་རྣམ་པར་ཕྱེ་བ། རིན་པོ་ཆེའི་ཁྲི་འཕང་གྲངས་མེད་པས་ཀུན་ནས་བསྐོར་བ།
en: It had a complete array of the precious jewels of Jambudhvaja. It was encircled by countless precious balconies.

source: ཕྱོགས་ཐམས་ཅད་ནས་རིན་པོ་ཆེའི་རྒྱལ་པོའི་ཐེམ་སྐས་མཛེས་པར་བཀྱེ་བ་གནས་པར་མཐོང་ངོ་།
en: On all sides, stairways made of kings of jewels were beautifully arranged.

source: །ཁང་པ་བརྩེགས་པ་དེའི་དབུས་ན་ཡང་ཁྲི་ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་པད་མོའི་སྙིང་པོ་ཅན།
en: He saw in the center of the kūṭāgāra a throne of wish-fulfilling jewels with a lotus on its center.

source: ནོར་བུ་རིན་པོ་ཆེའི་གཟུགས་འཇིག་རྟེན་གྱི་དབང་པོའི་དབྱིབས་ལྟ་བུའི་རྟེན་གྱིས་བཟུང་བ།
en: It was composed of precious jewels, and its base had the representations of all the lords of the world.

source: ནོར་བུ་རིན་པོ་ཆེའི་འབྲུ་ཐམས་ཅད་ཀྱི་ཁ་དོག་དུ་འདུག་པ།
en: It had the colors of all gems of precious jewels.

source: དབང་པོའི་རྒྱལ་མཚན་རབ་ཏུ་སྣང་བའི་དབྱིབས་སུ་འདུག་པ།
en: It had the shape of Indra’s radiant banner.

source: རྡོ་རྗེ་རིན་པོ་ཆེའི་འཁོར་ལོའི་ས་ལ་རྟེན་པ།
en: It was set upon the surface of a ground that was a circle of precious diamonds.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣ་ཚོགས་ཀྱི་ཕྲེང་བས་བརྒྱན་པ།
en: It had an array of rows of various kings of jewels.

source: རིན་པོ་ཆེའི་ཁྲི་འཕང་དུ་མ་ལས་བླངས་པ།
en: It was encircled by many precious platforms.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣང་བའི་རྒྱལ་མཚན་གྱིས་རབ་ཏུ་སྤྲས་པ།
en: It was decorated by shining banners of kings of jewels.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱན་གྱིས་ཤིན་ཏུ་བརྒྱན་པ།
en: It was beautified by an array of various jewels.

source: རིན་པོ་ཆེའི་རྒྱལ་པོའི་སྟན་ལྷ་རྫས་ལས་འདས་པ་ལེགས་པར་བཏིང་བ།
en: Upon it was placed a cushion that was superior to divine material.

source: གོས་རིན་པོ་ཆེ་ཁ་དོག་མཐའ་ཡས་པ་སྣ་ཚོགས་ཀྱི་གཞི་ཐམས་ཅད་དུ་བཀྲམ་པ།
en: Its surface was covered with precious cloths of various infinite colors.

source: རིན་པོ་ཆེའི་གོས་ཐམས་ཅད་ཀྱི་གནམ་ཡོལ་བྲེས་པས། ནམ་མཁའ་རབ་ཏུ་བརྒྱན་པ།
en: Decorative canopies of all kinds of precious cloth adorned the sky.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་དྲ་བ་ཀུན་ཏུ་བྲེས་པ།
en: It was draped in nets of all jewels.

source: ཕྱོགས་ཀུན་ནས་རིན་པོ་ཆེའི་རྒྱལ་མཚན་དགྲིགས་པའི་སྒྲ་འབྱུང་བ།
en: In all directions there was the sound of the flapping of arrayed precious banners.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་སྣམ་བུའི་རྒྱལ་མཚན་ཕུར་ལབ་དུ་ལྡིང་བ།
en: Banners of cloth made of all jewels fluttered.

source: སྤོས་ཀྱི་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རྒྱལ་མཚན་རྣམ་པར་བྲེས་པས་ཀུན་ནས་བརྒྱན་པ།
en: It was adorned by an arrangement of banners of all precious aromatic jewels.

source: མེ་ཏོག་ཐམས་ཅད་ཀྱི་རྒྱལ་མཚན་ལས་མེ་ཏོག་གི་གློང་སྣ་ཚོགས་ཆར་དུ་མངོན་པར་འབྲུལ་པ།
en: Banners made of all flowers emitted a rain of showers of various flowers.

source: རིན་པོ་ཆེའི་དྲིལ་བུའི་རྒྱལ་མཚན་འཁྲོལ་བའི་སྒྲ་ཡིད་བདེ་བའི་དབྱངས་སྙན་པར་གྲག་པ།
en: Banners of precious bells emitted melodious, beautiful sounds.

source: ཁང་པའི་ཁ་ཐམས་ཅད་ནས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཕྲེང་བ་རབ་ཏུ་སྦྱངས་པ།
en: All the entrances of the building were decorated with strings of various jewels.

source: རིན་པོ་ཆེའི་གཟུགས་སྣ་ཚོགས་ཀྱི་ཁ་ནས་སྤོས་ཆུ་ཁ་དོག་དུ་མ་དང་ལྡན་པའི་ཆར་འབབ་པ།
en: From various precious jewels in the form of spouts issued a rain of scented water in many different colors.

source: ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བ་ལས་གླང་པོ་དམ་པའི་གཟུགས་སུ་བྱས་པའི་ཁ་ནས་པད་མོའི་དྲ་བ་འབྱུང་བ་དང་ལྡན་པ།
en: From the mouths of elephant lords formed from shining kings of precious jewels came networks of lotuses.

source: རྡོ་རྗེ་སྣ་ཚོགས་ཀྱི་སེང་གེའི་ཁ་ནས་སྤོས་ཀྱི་སྤྲིན་ཁ་དོག་མཐའ་ཡས་པ་རབ་ཏུ་འབྱུང་བ།
en: From the mouths of lions made of a variety of diamonds came clouds of incense in endless colors.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བ། ཚངས་པའི་གཟུགས་སུ་འདུག་པའི་ཁ་ནས་བྱམས་པ་ཆེན་པོའི་ཚུལ་ཚངས་པའི་དབྱངས་ཀྱི་ང་རོ་སྒྲོག་པ་དང་ལྡན་པ།
en: From the mouths of statues of Brahmā made from shining kings of jewels there resounded in a loving manner the sound of the voice of Brahmā.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཤིན་ཏུ་མཛེས་པའི་གཟུགས་ཀྱི་ཁ་ནས་དཀར་པོའི་ཕྱོགས་ཀྱི་ལེགས་པ་རབ་ཏུ་བརྗོད་པའི་ང་རོ་འབྱུང་བ་དུས་གསུམ་གྱི་སངས་རྒྱས་ཀྱི་མཚན་གསེར་གྱི་དྲིལ་གྱི་ཕྲེང་བ་ལས་སྒྲ་སྙན་པའི་དབྱངས་སུ་འབྱུང་བ་དང་ལྡན་པ།
en: From the mouths of beautiful statues made of various jewels resounded the beautiful sounds of praises of goodness. From strings of golden bells were emitted the pleasant sounds of the names of the buddhas in the three times.

source: ནོར་བུ་རིན་པོ་ཆེ་དམ་པའི་དྲིལ་གྱི་ཕྲེང་བ་ལས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ཡིད་དུ་འོང་བ་འབྱུང་བ།
en: From strings of bells made of excellent precious jewels came the beautiful sounds of the Dharma wheels of all the buddhas.

source: རྡོ་རྗེའི་དྲིལ་སྣ་ཚོགས་ལས་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ཐམས་ཅད་ཀྱི་སྒྲ་རབ་ཏུ་འབྱུང་བ།
en: From a variety of diamond bells came the sounds of all bodhisattva prayers.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་ཟླ་བའི་རྒྱལ་མཚན་གྱི་ཕྲེང་བས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གཟུགས་བརྙན་རབ་ཏུ་འབྱུང་བའི་དབྱངས་སྣ་ཚོགས་རབ་ཏུ་བསྒྲག་པ།
en: Various voices resounded from the images of all the buddhas that arose from strings of moonstone kings of jewels.

source: ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྙིང་པོ་དག་པའི་ཕྲེང་བས་དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་ཚེ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་གཟུགས་བརྙན་རྣམ་པར་དམྱིགས་པར་བྱ་བ།
en: From strings of emerald kings of precious jewels came manifestations of images of the successive lives of all the tathāgatas in the three times.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་ཉི་མའི་སྙིང་པོའི་ཕྲེང་བས་ནམ་མཁའི་དབྱིངས་ཀྱི་མཐས་ཀླས་པའི་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་སྣ་ཚོགས་ཀྱི་དབྱིངས་སུ་འོད་ཟེར་ཡོངས་སུ་བསྟན་པ།
en: From strings of sunstone kings of jewels appeared light rays of the range of various buddha realms throughout the ten directions as far as the limits of the realm of space.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣང་བའི་རྒྱལ་མཚན་གྱི་ཕྲེང་བས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་སྣང་བ་རབ་ཏུ་བཀྱེ་བ།
en: From strings of avabhāsadhvaja kings of jewels shone the illumination of the halos of light of all the tathāgatas.

source: ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བའི་ཕྲེང་བས་སྤྲུལ་པའི་སྤྲིན་འགྲོ་བ་ཐམས་ཅད་ཀྱི་དབང་པོ་ལྟ་བུ་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་ཅིང་རིམ་གྲོར་བྱེད་པའི་འོད་རབ་ཏུ་དགྱེ་བ།
en: From strings of vairocana kings of jewels radiated light rays in the forms of emanated clouds of all the lords of worlds, who made offerings to and venerated the tathāgatas.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་ཡིད་བཞིན་གྱི་ཕྲེང་བས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་རྣམ་པར་འཕྲུལ་པས་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་སུ་རྒྱས་པར་དགང་བ།
en: From strings of wish-fulfilling kings of jewels there spread throughout the realm of phenomena in each instant the completely good miraculous manifestations of the bodhisattvas.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་རི་བོའི་རྒྱལ་མཚན་གྱི་ཕྲེང་བས། ལྷའི་དབང་པོ་ཐམས་ཅད་ཀྱི་ཁྱིམ་གྱི་ལྷ་མོའི་དབྱངས་སྙན་པ་རབ་ཏུ་བསྒྲག་པ་དང་ལྡན་ཞིང་ཁྲི་དེ།
en: From strings of vairocana kings of jewels resounded the sound of the voices of all the apsarases in the palaces of all the lords of devas emitting clouds of praises of all perceived tathāgatas, describing their inconceivable good qualities.

source: དམིགས་པ་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་ལ་བསྟོད་པའི་སྤྲིན་འགྱེད་པས་ཡོན་ཏན་དང་། ལེགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་བརྗོད་དུ་ཡོད་པ་དང་། རིན་པོ་ཆེའི་རྒྱན་གྲངས་མེད་པའི་འཁོར་གྱི་སྟན་གྱིས་བསྐོར་བར་མཐོང་ངོ་།
en: The throne was encircled by an array of seats made of countless jewels. He saw upon that throne Māyādevī.

source: །ཁྲི་དེ་ལ་ལྷ་མོ་སྒྱུ་མ་འཇིག་རྟེན་གསུམ་ལས་ཡང་དག་པར་འདས་པའི་གཟུགས་འཇིག་རྟེན་ཐམས་ཅད་ལ་མངོན་པར་གནས་པ་དང་། སྲིད་པའི་རྒྱུད་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པའི་གཟུགས་འགྲོ་བ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་དམིགས་སུ་ཡོད་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མ་གོས་པའི་གཟུགས་བསོད་ནམས་ཡངས་པས་བྱུང་བ་དང་། འགྲོ་བ་ཐམས་ཅད་དང་མཉམ་ཞིང་འདྲ་བའི་གཟུགས་སེམས་ཅན་ཐམས་ཅད་ལ་རང་བཞིན་མངོན་པར་སྟོན་པ་དང་། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བར་མཐུན་པའི་གཟུགས་སེམས་ཅན་ཐམས་ཅད་དང་མངོན་སུམ་དུ་འདལ་བ་དང་། དུས་གསུམ་ཐམས་ཅད་དུ་འགྲོ་བ་ནམ་མཁའ་ལ་རྣམ་པར་དམིགས་པ་ཐ་མི་དད་པའི་གཟུགས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་མཐས་ཀླས་པར་དམིགས་སུ་ཡོད་པར་བྱིན་གྱིས་རློབ་པ་དང་། འགྲོ་བ་མེད་པའི་གཟུགས་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་འགག་པ་དང་། འོང་བ་མེད་པའི་གཟུགས་འགྲོ་བ་ཐམས་ཅད་དུ་མ་བྱུང་བ་དང་། མ་སྐྱེས་པའི་གཟུགས་མི་སྐྱེ་བར་མཉམ་པའི་ཆོས་ལ་བརྩོན་པ་དང་། མ་འགགས་པའི་གཟུགས་འཇིག་རྟེན་གྱི་རྣམ་པར་སྤྱོད་པ་ཐམས་ཅད་ལ་གཞོལ་བ་དང་། ཡང་དག་པར་དམིགས་པའི་གཟུགས་བདེན་པ་མེད་པ་དང་། འཇིག་རྟེན་གྱི་རྣམ་པར་དམིགས་པའི་གཟུགས་བརྫུན་པ་མེད་པ་དང་། འཕོ་བ་མེད་པའི་གཟུགས་ཤི་འཕོ་བ་དང་། སྐྱེ་བ་ལས་འདས་པ་དང་། མི་འཇིག་པའི་གཟུགས་ཆོས་ཀྱི་དབྱིངས་ཀྱི་རང་བཞིན་གྱིས་འཇིག་པ་མེད་པ་དང་། མཚན་ཉིད་མེད་པའི་གཟུགས་དུས་གསུམ་ཚིག་གི་ལམ་དུ་གཞོལ་བ་དང་། མཚན་ཉིད་གཅིག་པའི་གཟུགས་མཚན་ཉིད་མེད་པས་བྱུང་བ་དང་། གཟུགས་བརྙན་ལྟ་བུའི་གཟུགས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་དང་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དམིགས་པ་དང་། སྒྱུ་མ་ལྟ་བུའི་གཟུགས་ཡེ་ཤེས་སྒྱུ་མས་ཡོངས་སུ་གྲུབ་པ་དང་། སྨིག་རྒྱུ་བ་ལྟ་བུའི་གཟུགས་འགྲོ་བའི་འདུ་ཤེས་བཞིན་དུ་བྱིན་གྱིས་རློབ་པ་ལ་གཞོལ་བ་དང་། གྲིབ་མ་ལྟ་བུའི་གཟུགས་སྔོན་གྱི་སྨོན་ལམ་གྱིས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་། རྨི་ལམ་ལྟ་བུའི་གཟུགས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་འགྲོ་བས་དམིགས་པ་ལ་མ་འདྲེས་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་གཞོལ་བའི་གཟུགས་ནམ་མཁའི་དབྱིངས་ལྟར་རང་བཞིན་ཡོངས་སུ་དག་པ་དང་། སྙིང་རྗེ་ཆེན་པོས་བྱུང་བའི་གཟུགས་སེམས་ཅན་གྱི་རྒྱུད་ཐམས་ཅད་ཡོངས་སུ་བསྐྱང་བ་ལ་བརྩོན་པ་དང་། ཆགས་པ་མེད་པའི་སྒོས་བྱུང་བའི་གཟུགས་སྐད་ཅིག་རེ་རེས་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་དང་། མཐའ་དང་དབུས་མེད་པའི་གཟུགས་རྙོག་པ་མེད་པར་འགྲོ་བ་ཐམས་ཅད་ལ་རྟེན་པ་དང་། ཚད་མེད་པའི་གཟུགས་ཚིག་གི་ལམ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ་དང་། མི་གནས་པའི་གཟུགས་འགྲོ་བ་ཐམས་ཅད་གདུལ་བའི་བྱིན་གྱི་རླབས་ཀྱིས་གྲུབ་པ་དང་། བྱིན་གྱིས་མ་བརླབས་པའི་གཟུགས་བྱིན་གྱི་རླབས་ཀྱིས་འགྲོ་བའི་དོན་ལ་བརྩོན་པ་དང་། མ་བྱུང་བའི་གཟུགས་སྨོན་ལམ་སྒྱུ་མས་ཡོངས་སུ་གྲུབ་པ་དང་། ཟིལ་གྱིས་མ་ནོན་པའི་གཟུགས་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་དང་། ཡང་དག་པ་མ་ཡིན་པའི་གཟུགས་ཞི་གནས་ཀྱི་སྣང་བས་རྣམ་པར་དམིགས་པ་དང་། མི་འབྱུང་བའི་གཟུགས་འགྲོ་བའི་ལས་ཇི་ལྟ་བ་བཞིན་དུ་རྗེས་སུ་འབྲང་བ་དང་། རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོ་ལྟར་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་སྨོན་ལམ་ཡོངས་སུ་གྲུབ་པ་དང་། རྣམ་པར་མི་རྟོག་པའི་གཟུགས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཡོངས་སུ་རྟོག་པ་བཞིན་དུ་ཉེ་བར་གནས་པ་དང་། མི་རྟོག་པས་རྟོག་པ་མེད་པའི་གཟུགས་འགྲོ་བ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་དམིགས་པ་དང་། ཐོགས་པ་མེད་པའི་གཟུགས་འཁོར་བ་ལས་བཟློག་པ་ལ་རབ་ཏུ་བརྩོན་པ་དང་། རྣམ་པར་དག་པའི་གཟུགས་དེ་བཞིན་ཉིད་དང་། མཉམ་པར་རྣམ་པར་མི་རྟོག་པ་དང་། རྣམ་པ་དེ་ལྟ་བུའི་གཟུགས་གཟུགས་མེད་པར་གཟུགས་སུ་སྣང་བ་དང་། ཚོར་བ་མེད་པའི་གཟུགས་ཀྱིས་འཇིག་རྟེན་གྱི་སྡུག་བསྔལ་གྱི་ཚོར་བ་རབ་ཏུ་ཞི་བར་བྱ་བ་ལ་བརྩོན་པ་དང་། འདུ་ཤེས་ཀྱི་རྣམ་པ་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པའི་གཟུགས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདུ་ཤེས་ཀྱི་རྣམ་པས་རྣམ་པར་དམིགས་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པའི་ཆོས་ཉིད་ཀྱིས་བྱུང་བའི་གཟུགས་ཆོས་སྒྱུ་མའི་རྣམ་པས་གྲུབ་པ་དང་། རྣམ་པར་ཤེས་པའི་ཡུལ་ལས་ཡོངས་སུ་འདས་པའི་གཟུགས་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ཀྱི་ཡེ་ཤེས་ལས་བྱུང་བ་དང་། རང་བཞིན་མེད་པའི་གཟུགས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཚིག་གི་ལམ་ལ་གཞོལ་བ་དང་། གདུང་བ་ཡོངས་སུ་བསྩལ་བའི་གཟུགས་ཆོས་ཀྱི་སྐུ་བསིལ་བ་དམ་པ་དང་ལྡན་པས།
en: She had a form that transcended the three worlds. She had a form that resided in all worlds and was above all existences. She had a form that was perceived by all beings according to their aspirations but was unstained by any world. She had a form that originated from vast merit and could resemble that of all beings. She had a form that appeared to all beings but in a way that would accord with ripening and guiding all beings. She had a form that was directly perceived by all beings but was at all times no different from beings’ perception of space. She had a form that had the power to be present as perceivable throughout the extent of all beings without going anywhere. She had a form that neither ceased nor came into existence within worlds. She had a form that did not originate in and was not born in any world. She had a form that was dedicated to having a quality the same as birthlessness but was also unceasing. She had a form that engaged in all conducts within the world and was truly perceived. She had a form that was not real but was perceived by the world. She had a form that was not false and did not pass away. She had a form that transcended death and birth and was indestructible. She had a form that had the indestructible nature of the realm of the Dharma and had no characteristics. She had a form that mastered the languages of the three times and had a single characteristic. She had a form that came forth with the excellent characteristic of the absence of characteristics and was like a reflection. She had a form that was perceived by all beings in accordance with their motivations and aspirations and was like an illusion. She had a form that was created by the illusion of wisdom and was like a mirage. She had a form that was intent on being present in the perception of beings in each instant and was like a shadow. She had a form that followed beings in accordance with her past prayers and was like a dream. She had a form that was perceived separately by beings according to their dispositions and was active in the entire realm of phenomena. She had a form that had a pure nature like the realm of space and arose from great compassion. She had a form that was dedicated to protecting all the classes of beings and arose through the gateway of the absence of attachment. She had a form that pervaded in each instant the entire realm of phenomena and had no end or middle. She had a form that was dependent on all beings without being polluted by them and was immeasurable. She had a form that transcended all words and had no location. She had a form that was an accomplished presence that guided all beings and had no presence. She had a form that through its presence was dedicated to benefiting beings and did not occur. She had a form that was created through the conjured illusion of prayer and was unsurpassable. She had a form that was above all worlds and was not what it seemed to be. She had a form that was perceived through the light of śamatha and was without origin. She had a form that followed beings in accordance with their karma and accomplished the prayers to fulfill the wishes of all beings like the king of wish-fulfilling jewels, without thought. She had a form that was present in accordance with the conceptions of all beings and, having no thought, was nonconceptual.

source: ལྷ་མོ་སྒྱུ་མ་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་འགྲོ་བའི་གཟུགས་ཀྱི་ལུས་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་གྱི་བསམ་པའི་དབང་དུ་འགྲོ་བ་ཐམས་ཅད་དང་མཉམ་ཞིང་འདྲ་བའི་གཟུགས་ཀྱི་ལུས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་གཟུགས་ཀྱི་ལུས་ལས་འཕགས་པ་སྟོན་ཅིང་འདུག་པ་མཐོང་ངོ་།
en: She had a form that was perceived by all beings and was without impediment. She had a form that was dedicated to turning beings away from saṃsāra and was completely pure. She had a form that, like the true nature, was without conceptualization and had that kind of mode. She had a form that appeared as form without having form and was without sensation. She had a form that was dedicated to the cessation of the sensations of worldly suffering and was above all the conceptualizations of beings. She had a form that was perceived by the perceptions of all beings and arose through the nature of not being formed. She had a form that occurred through the quality of illusory conjuration and transcended being an object of consciousness. She had a form that arose from the wisdom of bodhisattva prayer and had no nature of its own.

source: །དེ་ལ་སེམས་ཅན་ལ་ལས་ནི་ལྷ་མོ་སྒྱུ་མ་དེ་བདུད་ཀྱི་བུ་མོའི་གཟུགས་སུ་འདུག་ལ་བདུད་ཀྱི་བུ་མོའི་གཟུགས་བས་ཀྱང་ལྷག་པར་མཐོང་ངོ་།
en: She had a form that engaged in the languages of all beings and dispelled pain. Through possessing the supreme coolness of the Dharma body, Māyādevī revealed a form body in accordance with the aspirations of beings. In accordance with the aspirations of beings, she manifested bodies that resembled those of all beings and were superior to the form bodies of all beings. Some beings saw Māyādevī in the form of a daughter of Māra but superior to the form of a daughter of Māra

source: །ལ་ལས་ནི་དབང་བསྒྱུར་གྱི་ལྷའི་བུ་མོའི་གཟུགས་པས་ཀྱང་ལྷག་པར་མཐོང་ངོ་།
en: Some saw her as superior through having the form of one of Vaśavartin ’s apsarases.

source: །ལ་ལས་ནི་རབ་འཕྲུལ་དགའི་ལྷའི་བུ་མོའི་གཟུགས་པས་ཀྱང་ལྷག་པར་མཐོང་ངོ་།
en: Some saw her as superior through having the form of one of Sunirmita’s apsarases.

source: །ལ་ལས་ནི་རབ་དགའ་ལྡན་གྱི་ལྷའི་བུ་མོའི་གཟུགས་བས་ཀྱང་ལྷག་པར་མཐོང་ངོ་།
en: Some saw her as superior through having the form of one of Saṃtuṣita’s apsarases.

source: །ལ་ལས་ནི་རབ་མཚེ་མའི་ལྷའི་བུ་མོའི་གཟུགས་པས་ཀྱང་ལྷག་པར་མཐོང་ངོ་།
en: Some saw her as superior through having the form of one of Suyāma’s apsarases.

source: །ལ་ལས་ནི་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་བུ་མོའི་གཟུགས་པས་ཀྱང་ལྷག་པར་མཐོང་ངོ་།
en: Some saw her as superior through having the form of a Trāyastriṃśa apsaras.

source: །ལ་ལས་ནི་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་རིས་ཀྱི་ལྷའི་བུ་མོའི་གཟུགས་པས་ཀྱང་ལྷག་པར་མཐོང་ངོ་།
en: Some saw her as superior through having the form of a Caturmahārājika apsaras.

source: །ལ་ལས་ནི་གྲུལ་བུམ་གྱི་བུ་མོའི་གཟུགས་བས་ཀྱང་ལྷག་པར་མཐོང་ངོ་།
en: Some saw her as superior through having the form of a daughter of a lord of kumbhāṇḍas.

source: །ལ་ལས་ནི་ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོའི་བུ་མོའི་གཟུགས་པས་ཀྱང་ལྷག་པར་མཐོང་ངོ་།
en: Some saw her as superior through having the form of a daughter of a lord of mahoragas.

source: །སེམས་ཅན་ལ་ལས་ནི་ལྷ་མོ་སྒྱུ་མ་དེ་མིའི་དབང་པོའི་བུ་མོའི་གཟུགས་པས་ཀྱང་ལྷག་པར་མཐོང་ངོ་།
en: Some beings saw her as superior through having the form of a daughter of a lord of humans.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་གཟུགས་ཀྱི་འདུ་ཤེས་དང་བྲལ་ཡང་སེམས་ཅན་ཕ་རོལ་གྱི་བསམ་པ་ལ་འཇུག་པ་དེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པའི་རྣམ་པ་ལ་ལྷ་མོ་སྒྱུ་མ་འགྲོ་བ་ཐམས་ཅད་ཉེ་བར་འཚོ་བའི་བསོད་ནམས་དང་ལྡན་པ།
en: Sudhana, the head merchant’s son, although devoid of the concepts of the forms of all beings, was comprehending the thoughts of other beings, and he saw that in the thoughts of all beings Māyādevī had the merit to care for all beings;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བསོད་ནམས་ཀྱིས་བསྒྲུབས་པའི་ལུས་དང་ལྡན་པ།
en: she had a body created by the merit of omniscience;

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྦྱོར་བ་ཐ་མི་དད་པ་དང་ལྡན་པ།
en: she was inseparable from the practice of the perfection of generosity;

source: འགྲོ་བ་ཐམས་ཅད་ལ་མཉམ་པ་ཉིད་ཀྱི་ཞུགས་པ།
en: she engaged equally with all beings;

source: སྙིང་རྗེ་ཆེན་པོའི་ལྷས་སུ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྡུད་པ།
en: she gathered all beings into the enclosure of great compassion;

source: དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་ཐམས་ཅད་ལ་ནན་ཏན་དུ་བྱས་པས་བྱུང་བ།
en: she manifested from the practice of all the qualities of the tathāgatas;

source: བཟོད་པ་ཐམས་ཅད་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལ་ཞུགས་པ།
en: she had entered an ocean of all the ways of patience;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བརྩོན་འགྲུས་ཀྱི་ཤུགས་ཀྱིས་སེམས་ཅན་རྣམ་པར་སྤེལ་བ།
en: she increased mentation through the power of the diligence of omniscience;

source: ཆོས་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་ཕྱིར་མི་ལྡོག་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ།
en: she possessed the constant diligence that purified the entire field of phenomena;

source: ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་རྟོགས་པས་བྱུང་བ།
en: she had arisen from the realization of the nature of phenomena;

source: བསམ་གཏན་གྱི་ཡན་ལག་དང་ཚུལ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲུབ་པའི་སེམས་དང་ལྡན་པ།
en: she possessed a mind that had accomplished all the ways of the branches of dhyāna;

source: བསམ་གཏན་གྱི་ཡན་ལག་ཐ་མི་དད་པའི་ཡུལ་ཡོངས་སུ་འཛིན་པའི་དེ་བཞིན་གཤེགས་པའི་བསམ་གཏན་གྱི་དཀྱིལ་འཁོར་སྣང་བ་རབ་ཏུ་ཐོབ་པ།
en: she had attained the illumination of the field of dhyāna of the tathāgatas that possesses the undifferentiated range of the branches of dhyāna;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་རྒྱ་མཚོ་བསྐམ་པ་ལ་ཤིན་ཏུ་གདོན་མི་ཟ་བར་བྱས་པའི་ངེས་པར་རྟོག་པ་སྣ་ཚོགས་ལ་གནས་པ།
en: she dwelled in various realizations of how to definitively dry up the ocean of the kleśas of all beings;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་རྣམ་པར་དབྱེ་བའི་ཚུལ་ལ་མཁས་པ།
en: she had skill in the way of differentiating the Dharma wheels of all tathāgatas;

source: ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་རྒྱ་མཚོ་རྣམ་པར་དཔྱད་པའི་ཤེས་རབ་དང་ལྡན་པ།
en: she had the wisdom to analyze the ocean of all the ways of the Dharma;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཐོང་བས་མ་ངོམས་པ།
en: she never had enough of seeing all the tathāgatas;

source: དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལ་རྣམ་པར་ལྟ་བའི་རྒྱུན་མི་གཅོད་པ།
en: she had the continuous vision of the successions of the tathāgatas in the three times;

source: སངས་རྒྱས་ཐམས་ཅད་ལྟ་བའི་སྒོ་ལ་མངོན་དུ་གྱུར་བ།
en: she faced the gateway to seeing all the buddhas;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བསྒྲུབས་པའི་ལམ་ཡོངས་སུ་དག་པར་བྱ་བ་རྣམ་པ་ཐ་དད་པའི་ཚུལ་ལ་མཁས་པ།
en: she was skilled in the different ways of purifying the path accomplished by all the tathāgatas;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་ནམ་མཁའ་དང་མཉམ་པ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་ཐབས་ཀྱི་ཚུལ་ལ་མཁས་པ།
en: she had the field of activity of the tathāgatas, which is as extensive as space; she was skilled in the ways of the method of gathering all beings;

source: འགྲོ་བ་མཐའ་དང་དབུས་མེད་པ། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་སྣང་བ་རབ་ཏུ་ཐོབ་པ།
en: she had appearances that ripened and guided the vast extent of beings, without end or middle, in accordance with their aspirations;

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྐུ་རྣམ་པར་དག་པ་རྣམ་པ་ཐ་དད་པ་ལ་ཞུགས་པ།
en: she comprehended the different pure bodies of all buddhas;

source: ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བའི་སྨོན་ལམ་དང་ལྡན་པ།
en: she had the prayer to purify the ocean of all realms;

source: སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་རྣམ་པར་གདུལ་བའི་བྱིན་གྱི་རླབས་མཐར་ཐུག་པར་བྱ་བའི་སྨོན་ལམ་ཡོངས་སུ་དག་པ།
en: she had the pure prayer to reach the conclusion of having the presence with the power to guide all realms of beings;

source: དེ་བཞིན་གཤེགས་པའི་ཡུལ་ཐམས་ཅད་མཆོད་པས་རྒྱས་པར་དགང་བའི་སེམས་དང་། ལྡན་པ།
en: she had a mind that fills with offering the field of all buddhas;

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་ལ་བརྩོན་པས་བྱུང་བ།
en: she had arisen from dedication to all the miraculous manifestations of bodhisattvas;

source: ཆོས་ཀྱི་སྐུ་བླ་ན་མེད་པ་ཡོངས་སུ་དག་པ་དང་ལྡན་པ།
en: she possessed the pure, unsurpassable Dharma body;

source: གཟུགས་ཀྱི་ལུས་མཐའ་ཡས་པ་ཡོངས་སུ་སྟོན་པ།
en: she manifested endless form bodies;

source: བདུད་ཀྱི་དཔུང་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པ།
en: she defeated all the armies of Māra

source: དགེ་བའི་རྩ་བ་ཤིན་ཏུ་རྒྱ་ཆེན་པོའི་སྟོབས་དང་ལྡན་པ།
en: she possessed the strength of vast roots of merit;

source: ཆོས་ཀྱི་སྟོབས་རབ་ཏུ་སྐྱེས་པའི་བློ་ཅན།
en: she had a mind that generated the strength of the Dharma;

source: སངས་རྒྱས་ཀྱི་སྟོབས་སྣང་བ་རབ་ཏུ་ཐོབ་པ།
en: she had attained the illumination of the strengths of the buddhas;

source: བྱང་ཆུབ་སེམས་དཔའི་དབང་ཐམས་ཅད་ཀྱི་སྟོབས་ཡོངས་སུ་རྫོགས་པ།
en: she had perfected the strength of all the powers of a bodhisattva;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཤུགས་ཀྱི་སྟོབས་ཡོངས་སུ་སྐྱེས་པ།
en: she had developed the strength of the power of omniscience;

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་གློག་གིས་ཤེས་རབ་སྣང་བར་བྱས་པ།
en: she had illuminated wisdom with the lightning of the wisdom of the tathāgatas;

source: སེམས་ཅན་མཐའ་དང་དབུས་མེད་པའི་སེམས་རྒྱ་མཚོ་རྣམ་པར་དཔྱད་པ་ལ་མཁས་པ།
en: she was skilled in examining the ocean of the minds of the vast, centerless, endless extent of beings;

source: འགྲོ་བ་ཤིན་ཏུ་མང་བའི་བསམ་པ་ལ་ཞུགས་པ།
en: she comprehended the aspirations of the multitudes of beings;

source: སེམས་ཅན་ཕ་རོལ་གྱི་དབང་པོ་རྣམ་པ་ཐ་དད་པ་ཤེས་པར་བྱ་བའི་ཚུལ་ལ་མཁས་པ།
en: she was skilled in the ways of knowing the different capabilities of other beings;

source: སེམས་ཅན་མཐའ་ཡས་པའི་མོས་པ་རྣམ་པ་ཐ་དད་པའི་རྒྱུས་ལ་མཁས་པར་ཁོང་དུ་ཆུད་པ།
en: she had realized the skill in knowing the various aspirations of infinite beings;

source: ཕྱོགས་བཅུའི་ཞིང་རྒྱ་མཚོ་ཚད་མེད་པ་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་པ།
en: she filled the measureless ocean of realms in the ten directions with her bodies;
